{
    "info": {
        "title": "Приятно познакомиться!",
        "description": "Добро пожаловать в мой цифровой мир! Привет! Меня зовут Иван Бондаренко, и я фронтенд-разработчик, увлеченный созданием эстетически приятных и функционально богатых веб-приложений."
    },
    "about": {
        "title": "Обо мне",
        "description": "Я фронтенд-разработчик с глубоким пониманием основ веб-разработки и современных технологий. Мое путешествие началось с изучения HTML, CSS и JavaScript, что позволило мне заложить прочную основу для дальнейшего профессионального роста. С тех пор я неустанно расширял свои знания и навыки, освоив такие инструменты, как React, TypeScript и Redux, а также изучив принципы реактивного программирования и компонентного подхода к разработке интерфейсов. С каждым новым проектом я стремлюсь создавать не только функциональные, но и визуально привлекательные веб-сайты. Моя работа характеризуется чистотой кода, оптимизацией производительности и адаптивностью к различным устройствам и браузерам. Я уделяю большое внимание деталям и пользовательскому опыту, чтобы каждый сайт был не только красивым, но и интуитивно понятным и удобным для пользователя."
    },
    "activity": {
        "title": "Опыт работы",
        "firstItem": {
            "position": "Фронтенд Разработчик",
            "place": "Райффайзенбанк",
            "duty1": "Создание новых компонентов и доработка существующих на React и TypeScript.",
            "duty2": "Работа с метриками",
            "duty3": "Написание e2e-тестов",
            "duty4": "Верстка HTML-писем",
            "time": "01.04.2024 - По сегодня"
        },
        "secondItem": {
            "position": "Инженер QA",
            "place": "Банк ДОМ РФ",
            "duty1": "Ручное тестирование",
            "duty2": "Создание тест кейсов",
            "duty3": "Создание тестовых случаев",
            "time": "01.02.2024 - 01.04.2024"
        },
        "thirdItem": {
            "position": "Репетитор по SQL",
            "place": "Фриланс",
            "duty1": "Выполнение курсовых работ и различных задач по SQL",
            "time": "22.09.2022 - 22.09.2023"
        }
    },
    "stack": {
        "title": "Мой стэк",
        "text": "Мои технологии",
        "description": "Ниже приведен список технологий, которыми я владею."
    },
    "projects": {
        "title": "Проекты",
        "description": "Примеры моих проектов",
        "firstItem": {
            "description": "Сайт FOIL Network - технология проверки личности в сфере криптовалют",
            "title": "Cripto-Project"
        },
        "secondItem": {
            "description": "Современная торговая платформа с умными сделками и ботами",
            "title": "Capioco"
        },
        "thirdItem": {
            "description": "Информативный сайт с приглашением на санта-вечеринку",
            "title": "Prepare-a-sleigh"
        },
        "card": {
            "technology": "Технологии",
            "gallery": "Галлерея",
            "link": {
                "description": "Можно ознакомиться с сайтом целиком по кнопке ниже",
                "content": "Ознакомиться"
            },
            "firstItem": {
                "description": "Сайт FOIL Network - технология проверки личности в сфере криптовалют. Данный проект реализовал с помощью таких инстурментов разработки, как HTML, препроцессор SCSS, JavaScript. Использовался сборщик проектов Gulp. Проект выполнен в красочных цветах и тонах, которые отлично сочитаются с контентом на сайте. Выглядит современно и непременно приятно для глаз."
            },
            "secondItem": {
                "description": "Modern trading platform with smart trades and bots. This site was implemented using technologies such as Gulp collector, HTML, CSS and SCSS preprocessor. It combines rigor and style, made in modern colors. The site has many beautiful and easy-to-use carousels that make the site especially comfortable to use"
            },
            "thirdItem": {
                "description": "Информативный сайт с приглашением на санта-вечеринку. Данный сайт выполнен в стиле `Карусель` - каждая его страница представляет собой отдельную смысловую страницу. Сайт реализован с помощью таких технологий, как HTML, CSS, препроцессора SCSS, JavaScript, а также сборщик проектов Gulp. Сайт носит развлекательных характер и имеет спецефический контент и текст."
            }
        }
    },
    "contacts": {
        "title": "Контакты",
        "description": "Вы можете отправить свои предложения или пожелания - заполнив форму ниже. Также вы можете написать в мессенджерах, которые также будут указаны ниже. А я продолжу дальше делать крутые и удобные для пользователей сайты и приложения.",
        "form": {
            "title": "Для обратной связи",
            "labelName": "Имя",
            "labelEmail": "Почта",
            "labelMessage": "Сообщение"
        }
    },
    "sideBar": {
        "home": "Главная",
        "about": "Обо мне",
        "activity": "Опыт работы",
        "stack": "Стэк",
        "projects": "Проекты",
        "contacts": "Контакты"
    },
    "button": {
        "open": "Открыть",
        "submit": "Отправить",
        "back": "На главную"
    }
}