{
    "info": {
        "title": "Привет! Я",
        "name": "Иван Бондаренко",
        "description": "Фронтенд разработчик с опытом коммерческой разработки, создающий яркие и удобные веб-интерфейсы",
        "button": "Связаться"
    },
    "about": {
        "title": "Обо мне",
        "boxTitle": "Почему именно меня нужно нанимать на ваш ",
        "boxSpan": "Следующий проект",
        "description": "Я являюсь опытным фронтенд разработчиком с опытом работы в крупных организациях. У меня есть опыт создания коммерческих сайтов, где я успешно реализовывал проекты от концепции до запуска. Я умею работать с современными инструментами и технологиями, что позволяет мне создавать удобные и привлекательные интерфейсы.",
        "secondDescription": "Кроме того, я постоянно стремлюсь к саморазвитию и изучению новых трендов в веб-разработке, чтобы оставаться на передовой технологий. Моя цель — создавать не только функциональные, но и эстетически привлекательные решения, которые удовлетворяют потребности пользователей и клиентов."
    },
    "activity": {
        "title": "Опыт работы",
        "totalTime": "Суммарный опыт работы:  ",
        "thirdItem": {
            "position": "Репетитор по SQL",
            "place": "Фриланс",
            "duty1": "Выполнение курсовых работ и различных задач по SQL",
            "time": "22.09.2022 - 22.09.2023"
        }
    },
    "stack": {
        "title": "Навыки",
        "text": "Какими технологиями",
        "secontText": "Я Владею",
        "technology": {
            "react": "React",
            "html5": "HTML5",
            "sass": "SASS",
            "webpack": "Webpack",
            "typeScript": "TypeScript",
            "css3": "CSS3",
            "scss": "SCSS",
            "gulp": "Gulp",
            "redux": "Redux",
            "javaScript": "JavaScript",
            "git": "Git",
            "vite": "Vite"
        }
    },
    "projects": {
        "title": "Проекты",
        "description": "Примеры моих проектов",
        "firstItem": {
            "description": "Сайт FOIL Network - технология проверки личности в сфере криптовалют",
            "title": "Cripto-Project"
        },
        "secondItem": {
            "description": "Современная торговая платформа с умными сделками и ботами",
            "title": "Capioco"
        },
        "thirdItem": {
            "description": "Информативный сайт с приглашением на санта-вечеринку",
            "title": "Prepare-a-sleigh"
        },
        "fourthItem": {
            "description": "Интернет магазин с полным функционалом",
            "title": "Advolatum"
        },
        "fifthItem": {
            "description": "Сайт юридической компании",
            "title": "BM-Pravo"
        },
        "card": {
            "technology": "Технологии",
            "gallery": "Галлерея",
            "link": {
                "description": "Можно ознакомиться с сайтом целиком по кнопке ниже",
                "content": "Ознакомиться"
            },
            "firstItem": {
                "description": "Сайт FOIL Network - технология проверки личности в сфере криптовалют. Данный проект реализовал с помощью таких инстурментов разработки, как HTML, препроцессор SCSS, JavaScript. Использовался сборщик проектов Gulp. Проект выполнен в красочных цветах и тонах, которые отлично сочитаются с контентом на сайте. Выглядит современно и непременно приятно для глаз."
            },
            "secondItem": {
                "description": "Modern trading platform with smart trades and bots. This site was implemented using technologies such as Gulp collector, HTML, CSS and SCSS preprocessor. It combines rigor and style, made in modern colors. The site has many beautiful and easy-to-use carousels that make the site especially comfortable to use"
            },
            "thirdItem": {
                "description": "Информативный сайт с приглашением на санта-вечеринку. Данный сайт выполнен в стиле `Карусель` - каждая его страница представляет собой отдельную смысловую страницу. Сайт реализован с помощью таких технологий, как HTML, CSS, препроцессора SCSS, JavaScript, а также сборщик проектов Gulp. Сайт носит развлекательных характер и имеет спецефический контент и текст."
            }
        },
        "tab": {
            "title": {
                "firstItem": {
                    "text": "Интернет магазин",
                    "name": " Advolatum"
                },
                "secondItem": {
                    "text": "Информативный сайт",
                    "name": " Prepare a Sleight"
                },
                "thirdItem": {
                    "text": "Трейдинговая платформа",
                    "name": " Capico"
                },
                "fourthItem": {
                    "text": "Криптовалютный сайт",
                    "name": " Foil Network"
                },
                "fifthItem": {
                    "text": "Юридический сайт",
                    "name": " BM Pravo"
                }
            },
            "text": {
                "firstItem": "Advolatum — это современный интернет-магазин, предлагающий широкий ассортимент товаров с полным функционалом для удобного и безопасного онлайн-шопинга. Платформа разработана с акцентом на пользовательский опыт, обеспечивая интуитивно понятный интерфейс и простую навигацию.",
                "secondItem": "Интерактивный сайт, созданный для организации и приглашения гостей на незабываемую праздничную вечеринку в честь Дня Святого Николая. Сайт предлагает пользователям удобный и веселый способ отправить приглашения, узнать детали мероприятия и подготовиться к празднику.",
                "thirdItem": "Capico — это веб-платформа для трейдинга на криптовалютных биржах, предлагающая пользователям инструменты для самостоятельной торговли и использования торговых ботов. Платформа поддерживает мультичарт, анализ криптовалют и интеграцию с несколькими биржами",
                "fourthItem": "Foil Network — это многофункциональная блокчейн-платформа, предлагающая услуги по созданию смарт-контрактов и уникальных NFT. Она обеспечивает децентрализованную экономику и поддерживает кроссчейн технологии для хранения данных и управления экосистемой.",
                "fifthItem": "BM Pravo — это юридическая платформа, предоставляющая широкий спектр услуг в области права для физических и юридических лиц. Сайт предлагает профессиональные консультации, помощь в составлении и проверке юридических документов, а также представительство в суде."
            },
            "button": "Подробнее"
        }
    },
    "contacts": {
        "title": "Контакты",
        "description": {
            "text": "Для обратной",
            "name": " Связи"
        },
        "text": "Остались вопросы или хотите поработать вместе - напишите мне",
        "form": {
            "title": "Для обратной связи",
            "labelName": "Имя",
            "labelEmail": "Почта",
            "labelMessage": "Сообщение"
        }
    },
    "sideBar": {
        "home": "Главная",
        "about": "Обо мне",
        "activity": "Опыт",
        "stack": "Стэк",
        "projects": "Проекты",
        "contacts": "Контакты"
    },
    "button": {
        "open": "Открыть",
        "submit": "Отправить",
        "back": "На главную"
    },
    "modal": {
        "success": "Данные были успешно отправлены, до скорых встреч !",
        "error": "Упс, произошла ошибка с сервером, данные не отправлены"
    },
    "socials": {
        "gitHub": "GitHub"
    },
    "theme": "Сменить тему",
    "raiffeisen": {
        "position": "Фронтенд разработчик",
        "time": "01.04.2024 - Сейчас",
        "description": "Создавал интерфейсы на React и TypeScript, занимался оптимизацией, исправлением багов и интеграцией с бекендом для плавной работы."
    },
    "domRf": {
        "position": "QA Инженер",
        "time": "01.02.2024 - 01.04.2024",
        "description": "Выполнял ручное тестирование, разрабатывал тестовые сценарии. Написание тест кейсов."
    },
    "tutorSQL": {
        "position": "Репетитор по SQL",
        "time": "22.09.2022 - 22.09.2023",
        "description": "Выполнение лабораторных и курсовых работ различной сложности, используя язык запросов SQL"
    }
}