{
    "info": {
        "title": "Hi! I am",
        "name": "Ivan Bondarenko",
        "description": "A Frontend developer with commercial development experience who creates vibrant and user-friendly web interfaces",
        "button": "Contact"
    },
    "about": {
        "title": "About me",
        "boxTitle": "Why should I be hired for ",
        "boxSpan": "Next project",
        "description": "I am an experienced frontend developer with experience working in large organizations. I have experience creating commercial websites where I have successfully implemented projects from concept to launch. I am able to work with modern tools and technologies, which allows me to create user-friendly and attractive interfaces.",
        "secondDescription": "In addition, I am constantly striving for self-development and exploring new trends in web development in order to stay on the cutting edge of technology. My goal is to create not only functional, but also aesthetically pleasing solutions that meet the needs of users and customers."
    },
    "activity": {
        "title": "Experience",
        "totalTime": "Суммарный опыт работы:  "
    },
    "stack": {
        "title": "My Stack",
        "text": "What technologies do ",
        "secontText": "I Own",
        "technology": {
            "react": "React",
            "html5": "HTML5",
            "sass": "SASS",
            "webpack": "Webpack",
            "typeScript": "TypeScript",
            "css3": "CSS3",
            "scss": "SCSS",
            "gulp": "Gulp",
            "redux": "Redux",
            "javaScript": "JavaScript",
            "git": "Git",
            "vite": "Vite"
        }
    },
    "projects": {
        "title": "Projects",
        "description": "Examples of my projects",
        "firstItem": {
            "description": "FOIL Network website - technology for identity verification in the field of cryptocurrency",
            "title": "Cripto-Project"
        },
        "secondItem": {
            "description": "Modern trading platform with smart trades and bots",
            "title": "Capioco"
        },
        "thirdItem": {
            "description": "Informative website with santa - party invitation",
            "title": "Prepare-a-sleigh"
        },
        "card": {
            "technology": "Technology",
            "gallery": "Gallery",
            "link": {
                "description": "You can view the entire site using the button below.",
                "content": "Familiarize"
            },
            "firstItem": {
                "description": "FOIL Network website - identity verification technology in the field of cryptocurrencies. This project was implemented using development tools such as HTML, SCSS preprocessor, JavaScript. The Gulp project builder was used. The project is made in colorful colors and tones that go well with the content on the site. It looks modern and is certainly pleasing to the eye."
            },
            "secondItem": {
                "description": "Modern trading platform with smart trades and bots. This site was implemented using technologies such as Gulp collector, HTML, CSS and SCSS preprocessor. It combines rigor and style, made in modern colors. The site has many beautiful and easy-to-use carousels that make the site especially comfortable to use."
            },
            "thirdItem": {
                "description": "Informative site with an invitation to Santa's party. This site is designed in the `Carousel` style - each page is a separate semantic page. The site is implemented using technologies such as HTML, CSS, SCSS preprocessor, JavaScript, and the Gulp project builder. The site is entertaining in nature and has specific content and text."
            }
        },
        "tab": {
            "title": {
                "firstItem": {
                    "text": "Online store",
                    "name": " Advolatum"
                },
                "secondItem": {
                    "text": "Informative website",
                    "name": " Prepare a Sleight"
                },
                "thirdItem": {
                    "text": "Trading platform",
                    "name": " Capico"
                },
                "fourthItem": {
                    "text": "Cryptocurrency Website",
                    "name": " Foil Network"
                },
                "fifthItem": {
                    "text": "Legal website",
                    "name": " BM Pravo"
                }
            },
            "text": {
                "firstItem": "Advolatum is a modern online store offering a wide range of products with full functionality for convenient and secure online shopping. The platform is designed with a focus on the user experience, providing an intuitive interface and easy navigation.",
                "secondItem": "An interactive website designed to organize and invite guests to an unforgettable holiday party in honor of St. Nicholas Day. The site offers users a convenient and fun way to send invitations, find out the details of the event and prepare for the holiday.",
                "thirdItem": "Capico is a web—based platform for trading on cryptocurrency exchanges, offering users tools for independent trading and the use of trading bots. The platform supports multichat, cryptocurrency analysis, and integration with multiple exchanges.",
                "fourthItem": "Foil Network is a multifunctional blockchain platform offering services for creating smart contracts and unique NFTs. It provides a decentralized economy and supports cross-blockchain technologies for data storage and ecosystem management.",
                "fifthItem": "BM Pravo is a legal platform that provides a wide range of legal services for individuals and legal entities. The site offers professional advice, assistance in drafting and verifying legal documents, as well as representation in court."
            },
            "button": "More detailed"
        }
    },
    "contacts": {
        "title": "Contacts",
        "description": {
            "text": "For",
            "name": " Feedback"
        },
        "text": "If you have any questions or want to work together, write to me",
        "form": {
            "title": "For feedback",
            "labelName": "Name",
            "labelEmail": "Email",
            "labelMessage": "Message",
            "placeholder": {
                "name": "Ivanov Ivan",
                "email": "example@gmail.com",
                "message": "The text of your message"
            }
        }
    },
    "sideBar": {
        "home": "Home",
        "about": "About me",
        "activity": "Experience",
        "stack": "Stack",
        "projects": "Projects",
        "contacts": "Contacts"
    },
    "button": {
        "open": "Open",
        "submit": "Submit",
        "back": "To main"
    },
    "modal": {
        "success": "The data has been sent successfully, see you soon !",
        "error": "Oops, there was a server error, data not sent"
    },
    "socials": {
        "gitHub": "GitHub"
    },
    "theme": "Toggle Theme",
    "raiffeisen": {
        "position": "Frontend Developer",
        "time": "01.04.2024 - Now",
        "description": "Developed the frontend of a banking application using React/TypeScript: complex forms, dynamic interfaces, and responsive layout; API integration and UI kit support. Improved performance and reliability through refactoring, unit/E2E tests, and code review."
    },
    "domRf": {
        "position": "QA Engineer",
        "time": "07.02.2024 - 26.03.2024",
        "description": "Conducted manual testing of the web product: I wrote and updated test cases, maintained a simple coverage matrix, checked functionality using checklists, and fixed bugs. I also participated in regression testing before releases."
    },
    "frontendDeveloper": {
        "position": "Frontend Developer",
        "time": "01.05.2022 - 22.09.2023",
        "description": "Responsive and cross-browser layout of Figma interfaces: semantic HTML5, SCSS/CSS Modules, Grid/Flex, pixel-perfect; support for the UI kit, basic integration with React/TS, and optimization for loading (lazy/code splitting)"
    }
}